import blog01 from "@/public/blog01.webp";
import ser01 from "@/public/ser01.webp";
import ser03 from "@/public/ser03.webp";
import topAc from "@/public/topac.webp";

export const blogCardData = [
  {
    id: 1,
    image: blog01,
    title: "كيفية العثور على فني إصلاح الثلاجات المناسب",
    subtitle:
      "عندما تتعطل الثلاجة الخاصة بك، فإن العثور على فني إصلاح ثلاجات موثوق وماهر هو أولويتك القصوى. الفنيون المتخصصون....",
  },
  {
    id: 2,
    image: ser01,
    title: "خدمات إصلاح الثلاجات للعلامات التجارية الشهيرة",
    subtitle:
      "صيانة نظام التكييف الخاص بك أمر بالغ الأهمية للحفاظ عليه يعمل بكفاءة. التنظيف المنتظم والصيانة في الوقت المناسب يمكن أن يطيل عمره ويقلل من فواتير الطاقة. تعرف على المزيد حول كيفية العناية بنظام التكييف الخاص بك...",
  },
  {
    id: 3,
    image: ser03,
    title: "إصلاح الثلاجات في المنزل مقابل ورش الإصلاح",
    subtitle:
      "واحدة من أكثر التساؤلات شيوعًا بين الناس هي ما إذا كان يجب اختيار إصلاح الثلاجة في المنزل أو نقلها إلى ورشة الإصلاح...",
  },
  {
    id: 4,
    image: topAc,
    title: "لماذا تعتبر الصيانة الدورية للثلاجات مهمة",
    subtitle:
      "يعد التكييف مكونًا أساسيًا للحفاظ على راحة منزلك. إذا كنت تواجه مشكلات مع نظام التكييف الخاص بك، فمن الضروري فهم السبب الجذري وإيجاد حل يناسبك.",
  },
];
