export const faqData = [
  {
    heading: "ما هي أنواع الأجهزة التي تقومون بإصلاحها؟",
    info: "نحن متخصصون في إصلاح مكيفات الهواء، والغسالات الأوتوماتيكية، والثلاجات، ومجموعة واسعة من الأجهزة المنزلية والصناعية.",
  },
  {
    heading: "كيف يمكنني تحديد موعد لخدمة الإصلاح؟",
    info: "يمكنك بسهولة تحديد موعد للإصلاح عن طريق ملء نموذج الحجز عبر الإنترنت أو الاتصال بنا على الرقم 0576370554. سنقوم بتحديد موعد يناسب جدولك.",
  },
  {
    heading: "هل تقدمون خدمة في نفس اليوم؟",
    info: "نعم، نقدم خدمة في نفس اليوم لمعظم الإصلاحات، وذلك حسب توفر الفني وطبيعة المشكلة.",
  },
  {
    heading: "هل هناك ضمان على خدمة الإصلاح؟",
    info: "نعم، جميع إصلاحاتنا تأتي بضمان للخدمة. نضمن أن يكون عملنا على أعلى مستوى ونقدم ضمانًا لراحة بالك.",
  },
  {
    heading: "هل تقدمون خدمات إصلاح طارئة؟",
    info: "نعم، نقدم خدمات الإصلاح الطارئة للمشكلات العاجلة المتعلقة بمكيفات الهواء، والثلاجات، وغيرها من الأجهزة الهامة.",
  },
];
